Mutation/run/diffs/assegna1/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\assegna1\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -384,5 +384,5 @@
           se il parametro ConsDef è uguale a FALSE  commento: {37,} e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
         
-         ,altrimenti  commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
+         ,altrimenti  commento: {68,}Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False
         
         
@@ -496,5 +496,5 @@
                             DIStatement("""ITEStatementImpl\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
 
- ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3""", [
+ ,altrimenti  /*68,*/Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False""", [
                             DIBoolExpr("""NAryLogicOP (AND)\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1""", [
                             DIBoolExpr("""EqualImpl\n(consdef)  è uguale a  (False)""", [
@@ -532,9 +532,9 @@
             self.set_lds_mainclass_c1_comando_c4(False)
         #  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
-        #   ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
+        #   ,altrimenti  /*68,*/Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False
         if db((db(self.get_consdef() == False, di_ctx.subs[4].subs[0].subs[0]) and db(self.get_lds_mainclass_c1_variabile_v1() == self.get_lds_mainclass_c1_variabile_v1(), di_ctx.subs[4].subs[0].subs[1])), di_ctx.subs[4].subs[0]):
             self.get_lds_mainclass_c1_timer_t3().attiva()
         else:
-            self.get_lds_mainclass_c1_timer_t3().attiva()
+            self.set_lds_mainclass_c1_comando_c4(False)
     
     # verify macros
