Mutation/run/diffs/automatic-command-declaratio1/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1_priv.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\automatic-command-declaratio1\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
@@ -10,7 +10,10 @@
 typedef struct {
     bool event2;
+    bool event4;
+    bool argom;
+    C1_Enumerat3 argom1;
 } L_P1_C1_Comandi_Auto;
 
-#define L_P1_C1_NUM_COMANDI_AUTO 1
+#define L_P1_C1_NUM_COMANDI_AUTO 2
 
 
@@ -48,9 +51,27 @@
 #define L_P1__GetCAEvent2(my_id) (lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.event2)
 
+/* bool L_P1__GetCAEvent4(instance_id_t const my_id); */
+#define L_P1__GetCAEvent4(my_id) (lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.event4)
+
+/* bool L_P1__GetCAArgom(instance_id_t const my_id); */
+#define L_P1__GetCAArgom(my_id)  (lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.argom)
+
+/* C1_Enumerat3 L_P1__GetCAArgom1(instance_id_t const my_id); */
+#define L_P1__GetCAArgom1(my_id)  (lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.argom1)
+
 /* void L_P1__SetCAEvent2(instance_id_t const my_id, bool const value); */
 #define L_P1__SetCAEvent2(my_id, value)   lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.event2 = (value)
 
+/* void L_P1__SetCAEvent4(instance_id_t const my_id, bool const value); */
+#define L_P1__SetCAEvent4(my_id, value)   lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.event4 = (value)
 
+/* void L_P1__SetCAArgom(instance_id_t const my_id, bool const value); */
+#define L_P1__SetCAArgom(my_id, value)  lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.argom = (value)
 
+/* void L_P1__SetCAArgom1(instance_id_t const my_id, C1_Enumerat3 const value); */
+#define L_P1__SetCAArgom1(my_id, value)  lds_Stazione_data->L_P1_C1[my_id].comandi_automatici.argom1 = (value)
+
+
+
 // response
 ExecResponse L_P1_C1_GetResponse(instance_id_t const my_id);
