Mutation/run/diffs/automatic-command-declaratio1/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\automatic-command-declaratio1\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -14,4 +14,7 @@
         ++n;
     }
+    if (L_P1__GetCAEvent4(my_id)) {
+        ++n;
+    }
     return n;
 }
@@ -27,22 +30,22 @@
     if (L_P1__GetInEvent(my_id)) {
         #define IS_STATE_ACCEPTING_Event false // no state is accepting this command!
-        L_P1__SetOutEvent4(my_id, IS_STATE_ACCEPTING_Event ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
+        L_P1__SetOutEvent5(my_id, IS_STATE_ACCEPTING_Event ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
         isCommandPresent |= true;		
     } else {
-        L_P1__SetOutEvent4(my_id, LDS_MANCMD_NOOP);
+        L_P1__SetOutEvent5(my_id, LDS_MANCMD_NOOP);
     }
     if (L_P1__GetInEvent1(my_id)) {
         #define IS_STATE_ACCEPTING_Event1 false // no state is accepting this command!
-        L_P1__SetOutEvent5(my_id, IS_STATE_ACCEPTING_Event1 ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
+        L_P1__SetOutEvent6(my_id, IS_STATE_ACCEPTING_Event1 ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
         isCommandPresent |= true;		
     } else {
-        L_P1__SetOutEvent5(my_id, LDS_MANCMD_NOOP);
+        L_P1__SetOutEvent6(my_id, LDS_MANCMD_NOOP);
     }
     if (L_P1__GetInEvent3(my_id)) {
         #define IS_STATE_ACCEPTING_Event3 false // no state is accepting this command!
-        L_P1__SetOutEvent6(my_id, IS_STATE_ACCEPTING_Event3 ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
+        L_P1__SetOutEvent7(my_id, IS_STATE_ACCEPTING_Event3 ? LDS_MANCMD_BLOCKED : LDS_MANCMD_UNEXPECTED);
         isCommandPresent |= true;		
     } else {
-        L_P1__SetOutEvent6(my_id, LDS_MANCMD_NOOP);
+        L_P1__SetOutEvent7(my_id, LDS_MANCMD_NOOP);
     }
     
@@ -557,5 +560,5 @@
     }
 */
-bool L_P1__Macro3(instance_id_t const my_id , bool argom2, C1_Enumerat4 argom3, C1_Enumerat1 argom4, bool argom5, C1_Enumerat4 argom6, C1_Enumerat2 argom7)
+bool L_P1__Macro3(instance_id_t const my_id , bool argom4, C1_Enumerat4 argom5, C1_Enumerat1 argom6, bool argom7, C1_Enumerat4 argom8, C1_Enumerat2 argom9)
 {
 bool res_AndLogicOP_0 = true;
@@ -576,5 +579,5 @@
     
     res_AndLogicOP_3 = (res_AndLogicOP_3 && res_AndLogicOP_4);
-    res_AndLogicOP_3 = (res_AndLogicOP_3 && (argom5 == false));
+    res_AndLogicOP_3 = (res_AndLogicOP_3 && (argom7 == false));
     
     res_OrLogicOP_2 = (res_OrLogicOP_2 || res_AndLogicOP_3);
@@ -867,5 +870,5 @@
     }
 */
-C1_Enumerat1 L_P1__Macro1(instance_id_t const my_id , bool argom, C1_Enumerat4 argom1)
+C1_Enumerat1 L_P1__Macro1(instance_id_t const my_id , bool argom2, C1_Enumerat4 argom3)
 {
 C1_Enumerat1 res_macro_val;
