Mutation/run/diffs/automatic-command-declaratio2/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\automatic-command-declaratio2\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -1224,4 +1224,7 @@
         notifying_process.response_notify_auto_cmd(self, 'eventLds_mainclass_c1_command_comm5')
     
+    def eventNabcc_lds_mainclass_c1_command_comm5(self, notifying_process):
+        notifying_process.response_notify_auto_cmd(self, 'eventNabcc_lds_mainclass_c1_command_comm5')
+    
 
     def update_precedente(self):
