Mutation/run/diffs/blocco-congiunzione-logica1/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\blocco-congiunzione-logica1\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -1073,5 +1073,5 @@
         CNL corrispondente:
          
-        { commento: {62,} commento: {38,}  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  commento: {55,} contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Almeno una delle seguenti { 
+        { commento: {62,} commento: {38,}  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  commento: {55,} contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Tutte le seguenti  { 
           se il parametro ConsDef è uguale a FALSE  commento: {38,} o  se il contatore LDS_MainClass_C1_contatore_Co9 non è  uguale a  commento: {53,} 14, Verifica che   commento: {47,49,}  commento: {,}  il timer LDS_MainClass_C1_timer_T3 non sia attivo
          commento: {104,} e  che   il parametro ConsDef  sia  uguale a FALSE 
@@ -1090,5 +1090,5 @@
             if not macroDebInfo.is_initialized() :
                 macroDebInfo.initialize([
-                            DIBoolExpr("""NAryLogicOP (AND)\n/*62,*/ /*38,*/  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  /*55,*/ contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Almeno una delle seguenti { 
+                            DIBoolExpr("""NAryLogicOP (AND)\n/*62,*/ /*38,*/  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  /*55,*/ contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Tutte le seguenti  { 
   se il parametro ConsDef è uguale a FALSE  /*38,*/ o  se il contatore LDS_MainClass_C1_contatore_Co9 non è  uguale a  /*53,*/ 14, Verifica che   /*47,49,*/  /*,*/  il timer LDS_MainClass_C1_timer_T3 non sia attivo
  /*104,*/ e  che   il parametro ConsDef  sia  uguale a FALSE 
@@ -1099,5 +1099,5 @@
 
  } Verifica che   /*49,*/  /*,*/  il timer LDS_MainClass_C1_timer_T2 sia attivo""", [
-                            DIBoolExpr("""ImpliesLogicOpImpl\n/*62,*/ /*38,*/  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  /*55,*/ contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Almeno una delle seguenti { 
+                            DIBoolExpr("""ImpliesLogicOpImpl\n/*62,*/ /*38,*/  se il contatore LDS_MainClass_C1_contatore_Co6 è  minore di  /*55,*/ contatore LDS_MainClass_C1_contatore_Co6 e  se il parametro ConsDef  è  uguale a FALSE , Tutte le seguenti  { 
   se il parametro ConsDef è uguale a FALSE  /*38,*/ o  se il contatore LDS_MainClass_C1_contatore_Co9 non è  uguale a  /*53,*/ 14, Verifica che   /*47,49,*/  /*,*/  il timer LDS_MainClass_C1_timer_T3 non sia attivo
  /*104,*/ e  che   il parametro ConsDef  sia  uguale a FALSE 
