Mutation/run/diffs/condizione-attributo2/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizione-attributo2\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -276,5 +276,5 @@
      ,altrimenti  commento: {66,} Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False 
     
-    
+    se il controllo LDS_MainClass_C1_controllo_C9 è  uguale a False e 
       se il parametro ConsDef è uguale a FALSE  commento: {37,} e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
     
@@ -389,8 +389,13 @@
     L_P1__SetOutLds_m(my_id,false);
     }
+    //  se il controllo LDS_MainClass_C1_controllo_C9 è  uguale a False e 
     //  se il parametro ConsDef è uguale a FALSE  *37,* e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, *68,*Attiva il timer LDS_MainClass_C1_timer_T3
     // ,altrimenti  *68,*Attiva il timer LDS_MainClass_C1_timer_T3
     bool res_AndLogicOP_21 = true;
-    res_AndLogicOP_21 = (res_AndLogicOP_21 && (L_P1__GetParamConsd(my_id) == false));
+    bool res_AndLogicOP_22 = true;
+    res_AndLogicOP_22 = (res_AndLogicOP_22 && (L_P1__GetInLds_m6(my_id) == false));
+    res_AndLogicOP_22 = (res_AndLogicOP_22 && (L_P1__GetParamConsd(my_id) == false));
+    
+    res_AndLogicOP_21 = (res_AndLogicOP_21 && res_AndLogicOP_22);
     res_AndLogicOP_21 = (res_AndLogicOP_21 && (L_P1__GetLds_m10(my_id) == L_P1__GetLds_m10(my_id)));
     
