Mutation/run/diffs/condizione-attributo5/reports/report_in.txt.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\reports\report_in.txt
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizione-attributo5\out\reports\report_in.txt
@@ -73,4 +73,5 @@
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co9' non viene mai incrementato/decrementato/resettato, line 156
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co9' non viene mai incrementato/decrementato/resettato, line 160
+LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co9' non viene mai incrementato/decrementato/resettato, line 164
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co9' non viene mai incrementato/decrementato/resettato, line 81
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co9' non viene mai incrementato/decrementato/resettato, line 87
