Mutation/run/diffs/condizione-attributo8/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizione-attributo8\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -276,5 +276,5 @@
      ,altrimenti  commento: {66,} Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False 
     
-    
+     se lo stato  è  diverso da  commento: {56,}  state1 o 
       se il parametro ConsDef è uguale a FALSE  commento: {37,} e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
     
@@ -389,12 +389,19 @@
     L_P1__SetOutLds_m(my_id,false);
     }
+    //  se lo stato  è  diverso da  *56,*  state1 o 
     //  se il parametro ConsDef è uguale a FALSE  *37,* e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, *68,*Attiva il timer LDS_MainClass_C1_timer_T3
     // ,altrimenti  *68,*Attiva il timer LDS_MainClass_C1_timer_T3
-    bool res_AndLogicOP_21 = true;
-    res_AndLogicOP_21 = (res_AndLogicOP_21 && (L_P1__GetParamConsd(my_id) == false));
-    res_AndLogicOP_21 = (res_AndLogicOP_21 && (L_P1__GetLds_m10(my_id) == L_P1__GetLds_m10(my_id)));
+    bool res_OrLogicOP_21 = false;
+    bool res_NotLogicOP_22 = true;
+    res_NotLogicOP_22 = (res_NotLogicOP_22 && ! (L_P1_C1_GetState(my_id) == C1_St_state));
+    res_OrLogicOP_21 = (res_OrLogicOP_21 || res_NotLogicOP_22);
+    bool res_AndLogicOP_23 = true;
+    res_AndLogicOP_23 = (res_AndLogicOP_23 && (L_P1__GetParamConsd(my_id) == false));
+    res_AndLogicOP_23 = (res_AndLogicOP_23 && (L_P1__GetLds_m10(my_id) == L_P1__GetLds_m10(my_id)));
     
-    if(res_AndLogicOP_21){
+    res_OrLogicOP_21 = (res_OrLogicOP_21 || res_AndLogicOP_23);
     
+    if(res_OrLogicOP_21){
+    
     Timer_Attiva(L_P1__GetLds_m14(my_id));
     }else{
