Mutation/run/diffs/condizione-attributo8/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizione-attributo8\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -381,5 +381,5 @@
          ,altrimenti  commento: {66,} Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False 
         
-        
+         se lo stato  è  diverso da  commento: {56,}  state1 o 
           se il parametro ConsDef è uguale a FALSE  commento: {37,} e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
         
@@ -494,12 +494,21 @@
                             ]),#0
                             ]),#3
-                            DIStatement("""ITEStatementImpl\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
+                            DIStatement("""ITEStatementImpl\nse lo stato  è  diverso da  /*56,*/  state1 o 
+  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
 
  ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3""", [
-                            DIBoolExpr("""NAryLogicOP (AND)\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1""", [
+                            DIBoolExpr("""NAryLogicOP (OR)\nse lo stato  è  diverso da  /*56,*/  state1 o 
+  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1""", [
+                            DIBoolExpr("""Operatore Logico Not\nnegazione di ((lo stato di 'self')  è uguale a  (state1))""", [
+                            DIBoolExpr("""EqualImpl\n(lo stato di 'self')  è uguale a  (state1)""", [
+                            ]),#0
+                            ]),#0
+                            DIBoolExpr("""NAryLogicOP (AND)\n( (consdef)  è uguale a  (False) )  e  
+( (lds_mainclass_c1_variabile_v1)  è uguale a  (lds_mainclass_c1_variabile_v1) )""", [
                             DIBoolExpr("""EqualImpl\n(consdef)  è uguale a  (False)""", [
                             ]),#0
                             DIBoolExpr("""EqualImpl\n(lds_mainclass_c1_variabile_v1)  è uguale a  (lds_mainclass_c1_variabile_v1)""", [
                             ]),#1
+                            ]),#1
                             ]),#0
                             ]),#4
@@ -531,7 +540,8 @@
         else:
             self.set_lds_mainclass_c1_comando_c4(False)
-        #  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
+        #  se lo stato  è  diverso da  /*56,*/  state1 o 
+        #    se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
         #   ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
-        if db((db(self.get_consdef() == False, di_ctx.subs[4].subs[0].subs[0]) and db(self.get_lds_mainclass_c1_variabile_v1() == self.get_lds_mainclass_c1_variabile_v1(), di_ctx.subs[4].subs[0].subs[1])), di_ctx.subs[4].subs[0]):
+        if db((db(not db(self.get_fsmState() == Stazione.LdS.Logica.Enumeratives.LDS_MainClass_C1.Stateenumerator.state1, di_ctx.subs[4].subs[0].subs[0].subs[0]), di_ctx.subs[4].subs[0].subs[0]) or db((db(self.get_consdef() == False, di_ctx.subs[4].subs[0].subs[1].subs[0]) and db(self.get_lds_mainclass_c1_variabile_v1() == self.get_lds_mainclass_c1_variabile_v1(), di_ctx.subs[4].subs[0].subs[1].subs[1])), di_ctx.subs[4].subs[0].subs[1])), di_ctx.subs[4].subs[0]):
             self.get_lds_mainclass_c1_timer_t3().attiva()
         else:
