Mutation/run/diffs/condizione-verifica2/reports/report_in.txt.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\reports\report_in.txt
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizione-verifica2\out\reports\report_in.txt
@@ -83,5 +83,4 @@
 LDS_MainClass_C1.rfisrf_definition - warning: Il controllo dal piazzale 'lds_mainclass_c1_controllo_c6' non viene mai letto, line 31
 LDS_MainClass_C1.rfisrf_definition - warning: Il controllo dal piazzale 'lds_mainclass_c1_controllo_c9' dovrebbe avere accessibilità privata, line 32
-LDS_MainClass_C1.rfisrf_definition - warning: Il controllo dal piazzale 'lds_mainclass_c1_controllo_c9' non viene mai letto, line 32
 LDS_MainClass_C1.rfisrf_definition - warning: Il literal 'giallogiallo' dell'enumeratore 'Enumerator_1' non viene mai usato, line 64
 LDS_MainClass_C1.rfisrf_definition - warning: Il literal 'giallox' dell'enumeratore 'Enumerator_3' non viene mai usato, line 66
