Mutation/run/diffs/condizioni-list1/C/ClassesRelation.dot.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\ClassesRelation.dot
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\condizioni-list1\out\C\ClassesRelation.dot
@@ -6,6 +6,6 @@
 
 		 LDS_SubClass_C2 -> LDS_MainClass_C1[OperationKind=AUTO]  [list_name=lds_subclass_c2_lista_l1, field=lds_mainclass_c1, fieldType=LDS_MainClass_C1, op=R] [label="R:lds_subclass_c2_lista_l1.LDS_MainClass_C1"] 
-		 LDS_SubClass_C2 -> LDS_MainClass_C1[OperationKind=AUTO]  [list_name=lds_subclass_c2_lista_l7, field=lds_mainclass_c1, fieldType=LDS_MainClass_C1, op=R] [label="R:lds_subclass_c2_lista_l7.LDS_MainClass_C1"] 
 		 LDS_SubClass_C2 -> LDS_MainClass_C1[OperationKind=AUTO]  [list_name=lds_subclass_c2_lista_l4, field=lds_mainclass_c1, fieldType=LDS_MainClass_C1, op=R] [label="R:lds_subclass_c2_lista_l4.LDS_MainClass_C1"] 
+		 LDS_SubClass_C2 -> LDS_MainClass_C1[OperationKind=AUTO]  [list_name=lds_subclass_c2_lista_l7, field=lds_mainclass_c1, fieldType=LDS_MainClass_C1, op=R] [label="R:lds_subclass_c2_lista_l7.LDS_MainClass_C1"] 
 	}
 }
