Mutation/run/diffs/definizione-contatore1/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1_priv.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-contatore1\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
@@ -28,4 +28,5 @@
     Counter lds_m18;
     Counter lds_m19;
+    Counter nabcc;
     L_P1_C1_Comandi_Auto comandi_automatici;
     ExecResponse response;
