Mutation/run/diffs/definizione-controllo-piazzale3/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-controllo-piazzale3\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -143,5 +143,8 @@
         return self.memory.get_var(self.station_name,self.name,self.instance_name,"lds_mainclass_c1_controllo_c9")
 
+    def get_nabcc_mainclass_c1_controllo_c2(self):
+        return self.memory.get_var(self.station_name,self.name,self.instance_name,"nabcc_mainclass_c1_controllo_c2")
 
+
     # setters for state variables
     def set_lds_mainclass_c1_variabile_v1(self, lds_mainclass_c1_variabile_v1):
