Mutation/run/diffs/definizione-macro-verifica1/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-macro-effetto1\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
@@ -202,4 +202,5 @@
 // Macro di effetto
 void L_P1__Macro(instance_id_t const my_id );
+void L_P1__Macro6(instance_id_t const my_id );
 
 // Macro di verifica
