Mutation/run/diffs/definizione-macro-verifica1/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-macro-effetto1\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -404,5 +404,15 @@
 }
 
+/*
+    CNL corrispondente:
+     {Attiva il timer LDS_MainClass_C1_timer_T3}
+*/
+void L_P1__Macro6(instance_id_t const my_id )
+{
+//  Attiva il timer LDS_MainClass_C1_timer_T3
+    Timer_Attiva(L_P1__GetLds_m14(my_id));
+}
 
+
 // Macro di verifica
 
