Mutation/run/diffs/definizione-macro-verifica1/C/LdV/Stazione/include/Logica/ClasseLDV_MainClass_C1.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdV\Stazione\include\Logica\ClasseLDV_MainClass_C1.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-macro-effetto1\out\C\LdV\Stazione\include\Logica\ClasseLDV_MainClass_C1.h
@@ -154,18 +154,18 @@
 
 // Macro di effetto
-void L_P1__Macro16(instance_id_t const my_id );
 void L_P1__Macro17(instance_id_t const my_id );
 void L_P1__Macro18(instance_id_t const my_id );
 void L_P1__Macro19(instance_id_t const my_id );
 void L_P1__Macro20(instance_id_t const my_id );
+void L_P1__Macro21(instance_id_t const my_id );
 
 // Macro di verifica
-bool L_P1__Macro23(instance_id_t const my_id , bool argom39, C3_Enumerat4 argom40, bool argom41, C3_Enumerat1 argom42);
-bool L_P1__Macro24(instance_id_t const my_id , C3_Enumerat1 argom43, C3_Enumerat4 argom44, bool argom45, C3_Enumerat4 argom46, C3_Enumerat4 argom47, C3_Enumerat1 argom48, bool argom49);
-bool L_P1__Macro25(instance_id_t const my_id , C3_Enumerat3 argom50, C3_Enumerat4 argom51, C3_Enumerat3 argom52, C3_Enumerat1 argom53, bool argom54, C3_Enumerat3 argom55, C3_Enumerat4 argom56);
+bool L_P1__Macro24(instance_id_t const my_id , bool argom39, C3_Enumerat4 argom40, bool argom41, C3_Enumerat1 argom42);
+bool L_P1__Macro25(instance_id_t const my_id , C3_Enumerat1 argom43, C3_Enumerat4 argom44, bool argom45, C3_Enumerat4 argom46, C3_Enumerat4 argom47, C3_Enumerat1 argom48, bool argom49);
+bool L_P1__Macro26(instance_id_t const my_id , C3_Enumerat3 argom50, C3_Enumerat4 argom51, C3_Enumerat3 argom52, C3_Enumerat1 argom53, bool argom54, C3_Enumerat3 argom55, C3_Enumerat4 argom56);
 
 // Macro valorizzate
-bool L_P1__Macro21(instance_id_t const my_id , bool argom33, C3_Enumerat1 argom34, C3_Enumerat4 argom35, C3_Enumerat1 argom36);
-bool L_P1__Macro22(instance_id_t const my_id , bool argom37, C3_Enumerat4 argom38);
+bool L_P1__Macro22(instance_id_t const my_id , bool argom33, C3_Enumerat1 argom34, C3_Enumerat4 argom35, C3_Enumerat1 argom36);
+bool L_P1__Macro23(instance_id_t const my_id , bool argom37, C3_Enumerat4 argom38);
 
 
