Mutation/run/diffs/definizione-macro-verifica4/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-macro-verifica4\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
@@ -208,4 +208,5 @@
 bool L_P1__Macro4(instance_id_t const my_id );
 bool L_P1__Macro5(instance_id_t const my_id );
+bool L_P1__Macro6(instance_id_t const my_id , C1_Enumerat2 argom8);
 
 // Macro valorizzate
