Mutation/run/diffs/definizione-parametro1/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1_priv.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-parametro1\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
@@ -40,4 +40,5 @@
 bool L_P1__GetParamLds_m8(instance_id_t const my_id);
 bool L_P1__GetParamLds_m9(instance_id_t const my_id);
+C1_Enumerat3 L_P1__GetParamNabcc(instance_id_t const my_id);
 
 
