Mutation/run/diffs/definizione-timer3/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-timer3\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -129,4 +129,6 @@
     Timer_AggmInit(L_P1__GetLds_m15(my_id), true, CLASS_L_P1_C1_ID, my_id, L_P1__lds_m15_ID);
     Timer_Init(L_P1__GetLds_m15(my_id), 1430000);
+    Timer_AggmInit(L_P1__GetNabcc(my_id), true, CLASS_L_P1_C1_ID, my_id, L_P1__nabcc_ID);
+    Timer_Init(L_P1__GetNabcc(my_id), 42000);
     Counter_AggmInit(L_P1__GetLds_m16(my_id), true, CLASS_L_P1_C1_ID, my_id, L_P1__lds_m16_ID);
     Counter_Init(L_P1__GetLds_m16(my_id));
@@ -239,4 +241,5 @@
     Timer_Exec(L_P1__GetLds_m14(my_id));
     Timer_Exec(L_P1__GetLds_m15(my_id));
+    Timer_Exec(L_P1__GetNabcc(my_id));
 }
 
