Mutation/run/diffs/definizione-timer6/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1_priv.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\definizione-timer6\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1_priv.h
@@ -24,4 +24,5 @@
     Timer lds_m14;
     Timer lds_m15;
+    Timer nabcc;
     Counter lds_m16;
     Counter lds_m17;
