Mutation/run/diffs/disuguaglianza-valore4/Python/Stazione/LdS/Logica/LDS_MainClass_C1.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\disuguaglianza-valore4\out\Python\Stazione\LdS\Logica\LDS_MainClass_C1.py
@@ -381,5 +381,5 @@
          ,altrimenti  commento: {66,} Assegna al comando LDS_MainClass_C1_comando_C4 il valore  False 
         
-        
+        se  il parametro LDS_MainClass_C1_parametro_P2 è  uguale a  contatore LDS_MainClass_C1_contatore_Co6 o 
           se il parametro ConsDef è uguale a FALSE  commento: {37,} e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, commento: {68,}Attiva il timer LDS_MainClass_C1_timer_T3
         
@@ -494,12 +494,19 @@
                             ]),#0
                             ]),#3
-                            DIStatement("""ITEStatementImpl\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
+                            DIStatement("""ITEStatementImpl\nse  il parametro LDS_MainClass_C1_parametro_P2 è  uguale a  contatore LDS_MainClass_C1_contatore_Co6 o 
+  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
 
  ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3""", [
-                            DIBoolExpr("""NAryLogicOP (AND)\nse il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1""", [
+                            DIBoolExpr("""NAryLogicOP (OR)\nse  il parametro LDS_MainClass_C1_parametro_P2 è  uguale a  contatore LDS_MainClass_C1_contatore_Co6 o 
+  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1""", [
+                            DIBoolExpr("""EqualImpl\n(lds_mainclass_c1_parametro_p2)  è uguale a  (lds_mainclass_c1_contatore_co6)""", [
+                            ]),#0
+                            DIBoolExpr("""NAryLogicOP (AND)\n( (consdef)  è uguale a  (False) )  e  
+( (lds_mainclass_c1_variabile_v1)  è uguale a  (lds_mainclass_c1_variabile_v1) )""", [
                             DIBoolExpr("""EqualImpl\n(consdef)  è uguale a  (False)""", [
                             ]),#0
                             DIBoolExpr("""EqualImpl\n(lds_mainclass_c1_variabile_v1)  è uguale a  (lds_mainclass_c1_variabile_v1)""", [
                             ]),#1
+                            ]),#1
                             ]),#0
                             ]),#4
@@ -531,7 +538,8 @@
         else:
             self.set_lds_mainclass_c1_comando_c4(False)
-        #  se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
+        #  se  il parametro LDS_MainClass_C1_parametro_P2 è  uguale a  contatore LDS_MainClass_C1_contatore_Co6 o 
+        #    se il parametro ConsDef è uguale a FALSE  /*37,*/ e  se la variabile LDS_MainClass_C1_variabile_V1 è  uguale a variabile LDS_MainClass_C1_variabile_V1, /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
         #   ,altrimenti  /*68,*/Attiva il timer LDS_MainClass_C1_timer_T3
-        if db((db(self.get_consdef() == False, di_ctx.subs[4].subs[0].subs[0]) and db(self.get_lds_mainclass_c1_variabile_v1() == self.get_lds_mainclass_c1_variabile_v1(), di_ctx.subs[4].subs[0].subs[1])), di_ctx.subs[4].subs[0]):
+        if db((db(self.get_lds_mainclass_c1_parametro_p2() == self.get_lds_mainclass_c1_contatore_co6().get_valore(), di_ctx.subs[4].subs[0].subs[0]) or db((db(self.get_consdef() == False, di_ctx.subs[4].subs[0].subs[1].subs[0]) and db(self.get_lds_mainclass_c1_variabile_v1() == self.get_lds_mainclass_c1_variabile_v1(), di_ctx.subs[4].subs[0].subs[1].subs[1])), di_ctx.subs[4].subs[0].subs[1])), di_ctx.subs[4].subs[0]):
             self.get_lds_mainclass_c1_timer_t3().attiva()
         else:
