Mutation/run/diffs/disuguaglianza-valore4/reports/report_in.txt.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\reports\report_in.txt
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\disuguaglianza-valore4\out\reports\report_in.txt
@@ -59,4 +59,5 @@
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co6' non viene mai incrementato/decrementato/resettato, line 151
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co6' non viene mai incrementato/decrementato/resettato, line 156
+LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co6' non viene mai incrementato/decrementato/resettato, line 164
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co6' non viene mai incrementato/decrementato/resettato, line 81
 LDS_MainClass_C1.rfisrf_definition - warning: Il contatore 'lds_mainclass_c1_contatore_co6' non viene mai incrementato/decrementato/resettato, line 93
