Mutation/run/diffs/esiste/Python/Stazione/LdS/Logica/LDS_SubClass_C2.py.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\Python\Stazione\LdS\Logica\LDS_SubClass_C2.py
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\esiste\out\Python\Stazione\LdS\Logica\LDS_SubClass_C2.py
@@ -1179,5 +1179,5 @@
         CNL corrispondente:
          
-        { commento: {[} commento: {43,}  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4  è disattivo , assegna alla macro il valore spento
+         { commento: {[} commento: {43,}  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4 esiste e  è disattivo , assegna alla macro il valore spento  
         
          commento: {46,} assegna alla macro il valore spento commento: {],}
@@ -1188,6 +1188,6 @@
             if not macroDebInfo.is_initialized() :
                 macroDebInfo.initialize([
-                            DIStatement("""ITStatement\n/*[*/ /*43,*/  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4  è disattivo , assegna alla macro il valore spento""", [
-                            DIBoolExpr("""Predicato ForAll\nLDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4  è disattivo""", [
+                            DIStatement("""ITStatement\n/*[*/ /*43,*/  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4 esiste e  è disattivo , assegna alla macro il valore spento""", [
+                            DIBoolExpr("""ForAllPredicateNotEmptyImpl\nLDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4 esiste e  è disattivo""", [
                             DIBoolExpr("""Predicato Oggetto\nil timer 'lds_mainclass_c1_timer_t3 del campo lds_mainclass_c1 della lista lds_subclass_c2_lista_l4' è inattivo""", [
                             ]),#0
@@ -1197,6 +1197,6 @@
 
         populate_macroLds_subclass_c2_macrova_m8_SrfMacroDefInfo(di_ctx)
-        #  /*[*/ /*43,*/  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4  è disattivo , assegna alla macro il valore spento
-        if db(all(db(it.get_lds_mainclass_c1().get_lds_mainclass_c1_timer_t3().isDisattivato(), di_ctx.subs[0].subs[0].subs[0][idx]) for idx, it in enumerate(self.get_lds_subclass_c2_lista_l4())), di_ctx.subs[0].subs[0]):
+        #  /*[*/ /*43,*/  se LDS_MainClass_C1_timer_T3 del campo LDS_MainClass_C1  di LDS_SubClass_C2_lista_L4 esiste e  è disattivo , assegna alla macro il valore spento
+        if db(all_notempty(db(it.get_lds_mainclass_c1().get_lds_mainclass_c1_timer_t3().isDisattivato(), di_ctx.subs[0].subs[0].subs[0][idx]) for idx, it in enumerate(self.get_lds_subclass_c2_lista_l4())), di_ctx.subs[0].subs[0]):
             return GlobalEnumeration.spento
         #  /*46,*/ assegna alla macro il valore spento
