Mutation/run/diffs/macro-valorizzata-declaration-pubblico-senza-argomento/C/LdS/Stazione/include/Logica/ClasseLDS_MainClass_C1.h.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\macro-valorizzata-declaration-pubblico-senza-argomento\out\C\LdS\Stazione\include\Logica\ClasseLDS_MainClass_C1.h
@@ -211,4 +211,5 @@
 // Macro valorizzate
 C1_Enumerat1 L_P1__Macro1(instance_id_t const my_id , bool argom, C1_Enumerat4 argom1);
+bool L_P1__Macro6(instance_id_t const my_id );
 
 
