Mutation/run/diffs/macro-valorizzata-declaration-pubblico-senza-argomento/C/LdS/Stazione/src/Logica/ClasseLDS_MainClass_C1.c.diff
--- C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\original\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
+++ C:\Users\thesi\GitLab\nabucco\run\.\exec\0\0\mutations\macro-valorizzata-declaration-pubblico-senza-argomento\out\C\LdS\Stazione\src\Logica\ClasseLDS_MainClass_C1.c
@@ -892,4 +892,13 @@
 }
 
+/*
+    CNL corrispondente:
+     {assegna alla macro il valore False}
+*/
+bool L_P1__Macro6(instance_id_t const my_id )
+{
+return false;
+}
 
 
+
